{
    
    "text1" : "Skip to main content Search myBCom Search form Search Search Sauder Logo Search Utility menu COOL Canvas David Lam Library SSC Menu myBCom Main menu About UBC Sauder Orientation Orientation hiring Undergraduate Office Frequently asked questions Learning Commons and Library Book and equipment borrowing Printing and photocopying Study spaces Business Career Centre Student initiatives and government Alumni and friends Parent & Family Network Specialized learning spaces Digital Media Lab Leith Wheeler Investment Research Lab UBC Sauder Learning Labs Wayne Deans Investment Analysis Centre Academic Success Get better grades Peer Assisted Study Sessions (PASS) Presentation coaching Research support Communication Development Programs Math Coaching Get advice Know my rights and responsibilities Academic concession Academic integrity Attendance Statement of Professionalism and Code of Conduct Other academic resources Learning and studying resources Indigenous student resources BCom online learning and support Health & Wellness Global Reach International exchange Coming to UBC Sauder on exchange Career & Experience Career & Personal Exploration Personal Development Resources Career Exploration Resources What Can I Do With My Degree? UBC Sauder Alumni Job Data Navigate Your Career Journey Graduate Studies Gain Experience Work and Volunteer Experience Mentorship & Specialty Programs Co-op Program Job Search Resources COOL Career Platform Where can I work? Networking & Events Networking Resources LinkedIn Resources Industry Events & Workshop Resumes & Cover Letters Resume Resources Cover Letter Resources Job Interviews Interview Prep Resources Case Interview Resources Negotiation Resources COOL Career Platform Career Coaching & Advising BCom Career Strategists Career Peer Advisors Co-op Managers Co-op Program Why Co-op? My Co-op Experience Requirements & How to Apply Co-op Key Facts Frequently Asked Questions Co-op Employers Courses, Money & Enrolment Dates and deadlines Program requirements General program requirements Combined Major in Business and Computer Science UBC Sauder – HKU Dual Degree program Courses and registration Course search Registering for courses Summer courses Registration assistance Requesting documentation BCom course planning worksheets Taking courses outside of UBC Options Choose your option Registering for your option Option waitlist Double options Accounting Business Technology Management Entrepreneurship Finance Early start to the Finance option General Business Management Global Supply Chain and Logistics Management International Business Marketing Operations and Logistics Organizational Behaviour and Human Resources Real Estate Elective requirements Exams and grades Exams Grades Continuation and promotion Academic honours Academic concession Specialized academic opportunities UBC SWIFT: UBC Sauder Women in Finance Training Commerce Scholars Program UBC Sauder Public Speaking Competition UBCO cross campus mobility Minors and concentrations Minor in Arts or Science Minor in Commerce Business Analytics concentration Business Law concentration International Business concentration Sustainability and Social Impact concentration Scholarships and funding Scholarship search UGO Student Experience Grants Graduation Support Home About UBC Sauder Orientation Orientation UBC's motto is Tuum Est which translates to It’s Yours . We invite you to take full ownership of your university experience and approach learning with passion and enthusiasm. As a new student, join in orientation activities to learn about all of the programs and services available to you. As a returning student, stay involved and give back by volunteering to help UBC welcome the incoming class. Jump Start New first-year students Jump Start is an academic orientation designed to introduce you to the university, your professors, and your classmates. You’ll spend time with senior peers and professors in your Faculty, make your first friends, and learn more about the UBC services available to you before classes start. UBC is working closely with public health authorities, but you can expect to participate in Jump Start in person this year. By taking part in Jump Start, you will be provided opportunities to: Make friends: Be ready to hit the ground running on your first day of class. Over the course of the week, you’ll meet other first-year students who are new to UBC just like you. Meet profs and peers: Spend time with UBC professors and current students before classes start. They’ll introduce you to their research and the academic community, and give you tips to help you successfully transition from high school student to university scholar. Learn about your new home: Find out about all the UBC services available to you, and discover more about the campus community you’ll be joining. Jump Start (Residence stream) runs from August 27, 2023 to September 1, 2023. Jump Start (Commuter stream) runs from August 30, 2023 to September 1, 2023. Learn more about Jump Start Be social and have fun Share your orientation experience with the UBC community by tagging your posts with #IAMUBC and #UBCSauder. Connect with us on social media Imagine UBC All undergraduate students Imagine UBC is a UBC-wide orientation event that replaces the first day of classes for most students. This year, Imagine UBC will be held in person on Tuesday, September 5, 2023 . At Imagine UBC, you will be officially welcomed to the UBC Sauder School of Business by senior faculty leaders, participate in the UBC pep rally, meet some of your future professors and other students, and learn about clubs, resources, and involvement opportunities available across the university. You’ll receive more information about Imagine UBC later this summer, and no registration is required. Learn more about Imagine UBC Make friends for life Orientation is just your first step. Immerse yourself in university life through the many clubs and services offered by the AMS and CUS student societies. Explore student initiatives The Spark New-to-UBC Sauder students The Spark welcomes first year and transfer students to the UBC Sauder community and is a key part of the UBC Sauder experience. With a focus on building community within your team, you can expect cheering, dancing and games. Attending The Spark will help you make friends as you start your new journey at UBC Sauder. Every year, the Spark has a fun theme to tie the experience together, so join in the excitement! The Spark 2023 will be held on September 8 and 9. Learn more about The Spark Expand your scope There are plenty of opportunities within UBC Sauder to enrich your university experience, but remember that there's a diverse campus out there to explore. Look outside the walls of Henry Angus for ways to connect with students from other programs and faculties, and build your campus community. Find more ways to connect on campus Back To Top The University of British Columbia myBCom About UBC Sauder Academic Success Health & Wellness Global Reach Career & Experience Courses, Money & Enrolment Quicklinks Admissions for prospective students University of British Columbia UBC Student Services David Lam Library Emergency procedures and alerts Safety on campus Feedback See a typo or have a suggestion to improve the myBCom site? Email bcomquestions@sauder.ubc.ca Follow UBC Sauder on: Twitter Facebook LinkedIn YouTube Instagram UBC Sauder School of Business, 2053 Main Mall, Vancouver, BC Canada V6T 1Z2 | +1 604.822.8333 | email | site map | © Copyright UBC Hide Menu Explore myBCom Mobile menu About UBC Sauder Orientation Orientation hiring Undergraduate Office Frequently asked questions Learning Commons and Library Book and equipment borrowing Printing and photocopying Study spaces Business Career Centre Student initiatives and government Alumni and friends Parent & Family Network Specialized learning spaces Digital Media Lab Leith Wheeler Investment Research Lab UBC Sauder Learning Labs Wayne Deans Investment Analysis Centre Academic Success Get better grades Peer Assisted Study Sessions (PASS) Presentation coaching Research support Communication Development Programs Math Coaching Get advice Know my rights and responsibilities Academic concession Academic integrity Attendance Statement of Professionalism and Code of Conduct Other academic resources Learning and studying resources Indigenous student resources BCom online learning and support Health & Wellness Global Reach International exchange Coming to UBC Sauder on exchange Career & Experience Career & Personal Exploration Personal Development Resources Career Exploration Resources What Can I Do With My Degree? UBC Sauder Alumni Job Data Navigate Your Career Journey Graduate Studies Gain Experience Work and Volunteer Experience Mentorship & Specialty Programs Co-op Program Job Search Resources COOL Career Platform Where can I work? Networking & Events Networking Resources LinkedIn Resources Industry Events & Workshop Resumes & Cover Letters Resume Resources Cover Letter Resources Job Interviews Interview Prep Resources Case Interview Resources Negotiation Resources COOL Career Platform Career Coaching & Advising BCom Career Strategists Career Peer Advisors Co-op Managers Co-op Program Why Co-op? My Co-op Experience Requirements & How to Apply Co-op Key Facts Frequently Asked Questions Co-op Employers Courses, Money & Enrolment Dates and deadlines Program requirements General program requirements Combined Major in Business and Computer Science UBC Sauder – HKU Dual Degree program Courses and registration Course search Registering for courses Summer courses Registration assistance Requesting documentation BCom course planning worksheets Taking courses outside of UBC Options Choose your option Registering for your option Option waitlist Double options Accounting Business Technology Management Entrepreneurship Finance Early start to the Finance option General Business Management Global Supply Chain and Logistics Management International Business Marketing Operations and Logistics Organizational Behaviour and Human Resources Real Estate Elective requirements Exams and grades Exams Grades Continuation and promotion Academic honours Academic concession Specialized academic opportunities UBC SWIFT: UBC Sauder Women in Finance Training Commerce Scholars Program UBC Sauder Public Speaking Competition UBCO cross campus mobility Minors and concentrations Minor in Arts or Science Minor in Commerce Business Analytics concentration Business Law concentration International Business concentration Sustainability and Social Impact concentration Scholarships and funding Scholarship search UGO Student Experience Grants Graduation Support COOL Canvas David Lam Library SSC said none let's see if this works",
    "text2" : "Skip to main content Search myBCom Search form Search Search Sauder Logo Search Utility menu COOL Canvas David Lam Library SSC Menu myBCom Main menu About UBC Sauder Orientation Orientation hiring Undergraduate Office Frequently asked questions Learning Commons and Library Book and equipment borrowing Printing and photocopying Study spaces Business Career Centre Student initiatives and government Alumni and friends Parent & Family Network Specialized learning spaces Digital Media Lab Leith Wheeler Investment Research Lab UBC Sauder Learning Labs Wayne Deans Investment Analysis Centre Academic Success Get better grades Peer Assisted Study Sessions (PASS) Presentation coaching Research support Communication Development Programs Math Coaching Get advice Know my rights and responsibilities Academic concession Academic integrity Attendance Statement of Professionalism and Code of Conduct Other academic resources Learning and studying resources Indigenous student resources BCom online learning and support Health & Wellness Global Reach International exchange Coming to UBC Sauder on exchange Career & Experience Career & Personal Exploration Personal Development Resources Career Exploration Resources What Can I Do With My Degree? UBC Sauder Alumni Job Data Navigate Your Career Journey Graduate Studies Gain Experience Work and Volunteer Experience Mentorship & Specialty Programs Co-op Program Job Search Resources COOL Career Platform Where can I work? Networking & Events Networking Resources LinkedIn Resources Industry Events & Workshop Resumes & Cover Letters Resume Resources Cover Letter Resources Job Interviews Interview Prep Resources Case Interview Resources Negotiation Resources COOL Career Platform Career Coaching & Advising BCom Career Strategists Career Peer Advisors Co-op Managers Co-op Program Why Co-op? My Co-op Experience Requirements & How to Apply Co-op Key Facts Frequently Asked Questions Co-op Employers Courses, Money & Enrolment Dates and deadlines Program requirements General program requirements Combined Major in Business and Computer Science UBC Sauder – HKU Dual Degree program Courses and registration Course search Registering for courses Summer courses Registration assistance Requesting documentation BCom course planning worksheets Taking courses outside of UBC Options Choose your option Registering for your option Option waitlist Double options Accounting Business Technology Management Entrepreneurship Finance Early start to the Finance option General Business Management Global Supply Chain and Logistics Management International Business Marketing Operations and Logistics Organizational Behaviour and Human Resources Real Estate Elective requirements Exams and grades Exams Grades Continuation and promotion Academic honours Academic concession Specialized academic opportunities UBC SWIFT: UBC Sauder Women in Finance Training Commerce Scholars Program UBC Sauder Public Speaking Competition UBCO cross campus mobility Minors and concentrations Minor in Arts or Science Minor in Commerce Business Analytics concentration Business Law concentration International Business concentration Sustainability and Social Impact concentration Scholarships and funding Scholarship search UGO Student Experience Grants Graduation Support Home Courses, Money and Enrolment Courses and registration Course search COMM 483 - Leadership and General Management COMM 483 - Leadership and General Management The Course Click here to view the proposed class scheduled for 2023W. Click here to view the 2022W course syllabus. COMM 483 is designed to be a transformative and personal experience. It is a leadership course modeled after Harvard's first year MBA program and led by Professor Adel Gamar. In this course, leadership is viewed not as a position but an art that is accessible to anyone committed to developing and refining their practice. Learning is a vital component to the art and practice of leadership. It is a noble path that demands integrity, collaboration, and empathy. To inculcate a learning environment, students forge a community bound by collective trust while ensuring psychological safety for everyone. Through case studies, class discussions, and guest speakers, students grapple with complex challenges that include business, management, policy, and strategy. The course covers a wide range of topics and will be balanced with student experiences and interests reflected in the diverse cohort that this course attracts. This course aims to help prepare students for the challenges of leadership in an adaptive, interconnected, and inclusive world. Guest speakers included Senator Mobina Jaffer, Roger Dall'Antonia (CEO of FortisBC Inc.), Tamara Vrooman (CEO of YVR), and Carolina Larriera (former UN Diplomat). COMM 483 is worth six credits and is taught over six weekends in Term 2. Over the term, students will be required to analyze approximately 30 cases, write a 10-page self-reflective essay, complete 4-5 group assignments, stay up-to-date with current events, and actively participate in the class discussions. The summer before, you will also be required to complete various readings on leadership. There is an active social aspect and deep collegial connection to the course. The Students The true value of the course comes from the students who take part in it. We are looking for the most imaginative, ambitious, hardworking people who will be in their third year or above in Term 2 of the 2023 Winter Session (January to April 2024). Students who believe they offer something 'different' are encouraged to apply. Note: COMM 483 has a heavy course load. We encourage you seek out alumni and ask them about the course. Student Testimonials For student testimonials, COMM 483 alumni helped create this video . Learning objectives The objectives of this course are: to become self-aware of and develop one’s ability to exercise leadership. to integrate and apply knowledge gained from previous business courses to business cases. to learn to absorb and analyze information to make business decisions. to improve verbal communication and presentation ability. to improve one’s ability to collaborate with others. to actively learn from the experiences of classmates and community leaders. Information sessions We're pleased to invite you to attend an information session to learn more about COMM 483 course. COMM 483 Info Sessions Date & Time: Friday, October 6, 2023 Location (Zoom): Click here to complete the application form . Application Open: Tuesday, October 3, 2023 at 9AM Application Close: Friday, October 20, 2023 at 5PM Interview Dates: Oct 28 & 29, 2023 (Subject to change) Offers Sent Out: TBD For latest course updates, please join our Facebook group . For any questions, please contact the Course TAs at COMM483@sauder.ubc.ca . About the professor Adel Gamar is CEO of a boutique consultancy specializing in adaptive leadership, organizational strategy, and change management. Over the course of his career, he has advised senior leaders of Fortune 500 companies, nonprofit organizations, and governments worldwide. He is a former policy fellow at Harvard Law School, UNESCO Education Specialist, and taught adaptive leadership and negotiation at Harvard. Gamar is Board Chair of Douglas College and cofounder of The Gamar Foundation, a nonprofit that aims to inspire, empower, and connect young people to make a positive difference for the greater public good. He holds an MPA from Harvard and a B.Ed. from the University of Calgary. Note: Three of the six credits for COMM 483 can be applied to the Year 4 capstone requirement (one of COMM 486M, COMM 491, COMM 492, COMM 497, COMM 498). Please see program requirements for more information. Course credits: 6 Back To Top The University of British Columbia myBCom About UBC Sauder Academic Success Health & Wellness Global Reach Career & Experience Courses, Money & Enrolment Quicklinks Admissions for prospective students University of British Columbia UBC Student Services David Lam Library Emergency procedures and alerts Safety on campus Feedback See a typo or have a suggestion to improve the myBCom site? Email bcomquestions@sauder.ubc.ca Follow UBC Sauder on: Twitter Facebook LinkedIn YouTube Instagram UBC Sauder School of Business, 2053 Main Mall, Vancouver, BC Canada V6T 1Z2 | +1 604.822.8333 | email | site map | © Copyright UBC Hide Menu Explore myBCom Mobile menu About UBC Sauder Orientation Orientation hiring Undergraduate Office Frequently asked questions Learning Commons and Library Book and equipment borrowing Printing and photocopying Study spaces Business Career Centre Student initiatives and government Alumni and friends Parent & Family Network Specialized learning spaces Digital Media Lab Leith Wheeler Investment Research Lab UBC Sauder Learning Labs Wayne Deans Investment Analysis Centre Academic Success Get better grades Peer Assisted Study Sessions (PASS) Presentation coaching Research support Communication Development Programs Math Coaching Get advice Know my rights and responsibilities Academic concession Academic integrity Attendance Statement of Professionalism and Code of Conduct Other academic resources Learning and studying resources Indigenous student resources BCom online learning and support Health & Wellness Global Reach International exchange Coming to UBC Sauder on exchange Career & Experience Career & Personal Exploration Personal Development Resources Career Exploration Resources What Can I Do With My Degree? UBC Sauder Alumni Job Data Navigate Your Career Journey Graduate Studies Gain Experience Work and Volunteer Experience Mentorship & Specialty Programs Co-op Program Job Search Resources COOL Career Platform Where can I work? Networking & Events Networking Resources LinkedIn Resources Industry Events & Workshop Resumes & Cover Letters Resume Resources Cover Letter Resources Job Interviews Interview Prep Resources Case Interview Resources Negotiation Resources COOL Career Platform Career Coaching & Advising BCom Career Strategists Career Peer Advisors Co-op Managers Co-op Program Why Co-op? My Co-op Experience Requirements & How to Apply Co-op Key Facts Frequently Asked Questions Co-op Employers Courses, Money & Enrolment Dates and deadlines Program requirements General program requirements Combined Major in Business and Computer Science UBC Sauder – HKU Dual Degree program Courses and registration Course search Registering for courses Summer courses Registration assistance Requesting documentation BCom course planning worksheets Taking courses outside of UBC Options Choose your option Registering for your option Option waitlist Double options Accounting Business Technology Management Entrepreneurship Finance Early start to the Finance option General Business Management Global Supply Chain and Logistics Management International Business Marketing Operations and Logistics Organizational Behaviour and Human Resources Real Estate Elective requirements Exams and grades Exams Grades Continuation and promotion Academic honours Academic concession Specialized academic opportunities UBC SWIFT: UBC Sauder Women in Finance Training Commerce Scholars Program UBC Sauder Public Speaking Competition UBCO cross campus mobility Minors and concentrations Minor in Arts or Science Minor in Commerce Business Analytics concentration Business Law concentration International Business concentration Sustainability and Social Impact concentration Scholarships and funding Scholarship search UGO Student Experience Grants Graduation Support COOL Canvas David Lam Library SSC apsc et this works"

}